### [Pandas API](https://pandas.pydata.org/pandas-docs/stable/api.html#id7)

In [28]:
from pandas import DataFrame, Series
import pandas as pd
import numpy as np

In [7]:
print(pd.period_range('2014-10-18','2018-03-04', freq='D'))
len(pd.period_range('2014-10-18','2018-03-04', freq='D'))

PeriodIndex(['2014-10-18', '2014-10-19', '2014-10-20', '2014-10-21',
             '2014-10-22', '2014-10-23', '2014-10-24', '2014-10-25',
             '2014-10-26', '2014-10-27',
             ...
             '2018-02-23', '2018-02-24', '2018-02-25', '2018-02-26',
             '2018-02-27', '2018-02-28', '2018-03-01', '2018-03-02',
             '2018-03-03', '2018-03-04'],
            dtype='period[D]', length=1234, freq='D')

1234

#### .infer_freq

In [11]:
df= pd.read_table('./data/ex_df.txt')
df

   1  500  5
0  2  200  2
1  3  200  7
2  4   50  9

In [13]:
columns1=['name', 'price', 'qty']
df.columns= columns1
df

   name  price  qty
0     2    200    2
1     3    200    7
2     4     50    9

In [15]:
index1= ['one','one','two']
df.index= index1
df

     name  price  qty
one     2    200    2
one     3    200    7
two     4     50    9

In [22]:
# 쓰는 방법?? pd.infer_freq(df.index)

In [24]:
ser1= Series([4,7,-5,3]); ser1

0    4
1    7
2   -5
3    3
dtype: int64

In [25]:
ser1.ftype

'int64:dense'

In [35]:
ser2= Series(np.eye(20)[1]); ser2

0     0.0
1     1.0
2     0.0
3     0.0
4     0.0
5     0.0
6     0.0
7     0.0
8     0.0
9     0.0
10    0.0
11    0.0
12    0.0
13    0.0
14    0.0
15    0.0
16    0.0
17    0.0
18    0.0
19    0.0
dtype: float64

In [36]:
ser2.ftype

'float64:dense'

In [37]:
Series(np.eye(20)[1]).ftype

'float64:dense'

In [41]:
df1= DataFrame([0,1,2,np.nan,4], columns=['B']); df1

     B
0  0.0
1  1.0
2  2.0
3  NaN
4  4.0

In [45]:
df1.ewm(com= 0.5).mean()

          B
0  0.000000
1  0.750000
2  1.615385
3  1.615385
4  3.670213

#### pandas.Series.truncate

In [48]:
chr(ord('a')+1)

'b'

In [74]:
abcx= [chr(i) for i in range(97,97+24,1)]
arr_abcx= np.array(abcz).reshape((4,6))
# index1= range(1,5,1)
index1= ['A','G','M','S']
df_abcx= DataFrame(arr_abcx, index= index1)
df_abcx

   0  1  2  3  4  5
A  a  b  c  d  e  f
G  g  h  i  j  k  l
M  m  n  o  p  q  r
S  s  t  u  v  w  x

In [58]:
type(np.arange(5))

numpy.ndarray

In [77]:
df_abcx.truncate(before='G', after='M')

   0  1  2  3  4  5
G  g  h  i  j  k  l
M  m  n  o  p  q  r

In [78]:
df_abcx

   0  1  2  3  4  5
A  a  b  c  d  e  f
G  g  h  i  j  k  l
M  m  n  o  p  q  r
S  s  t  u  v  w  x

## .query
indexing의 왕인듯. 근데 evil 같단 느낌이..

In [80]:
from numpy.random import randn
from pandas import DataFrame
df= DataFrame(randn(10,2), columns= list('ab'));df

          a         b
0 -1.716811  1.662137
1 -0.362116  1.540246
2 -0.119502 -0.702230
3  0.941806  0.148591
4 -2.326265  0.652906
5 -0.737634  1.432031
6 -1.589780 -0.225236
7  0.659816 -2.416051
8  0.705029 -0.103123
9  1.452753  1.029395

In [81]:
df.query('a>b')

          a         b
2 -0.119502 -0.702230
3  0.941806  0.148591
7  0.659816 -2.416051
8  0.705029 -0.103123
9  1.452753  1.029395

In [85]:
df.query('a.min()>b')

          a         b
7  0.659816 -2.416051

In [83]:
df[df['a']>df['b']]

          a         b
2 -0.119502 -0.702230
3  0.941806  0.148591
7  0.659816 -2.416051
8  0.705029 -0.103123
9  1.452753  1.029395